package main

import (
	"fmt"
)

func main() {
	var a bool = true
	var b bool = false

	fmt.Println(a)
	fmt.Println(b)
}

/*
整数取值范围:
int8(-128 -> 127);
int16(-32768 -> 32767);
int32(-2,147,483,648 -> 2,147,483,647);
int64(-9,223,372,036,854,775,808 -> 9,223,372,036,854,775,807);

无符号整数:
uint8(0 -> 255);
uint16(0 -> 65,535);
uint32(0 -> 4,294,967,295);
uint64(0 -> 18,446,744,073,709,551,615);

运算符与优先级
优先级	运算符
7		^ !
6		* / % << >> & &^
5		+ - | ^
4		== != < <= >= >
3		<-
2		&&
1		||

从上到下优先级从高到低
*/
